//
//  StaticTexts.swift
//  OldHymns
//
//  Created by JooYoung Kim on 10/2/25.
//

// StaticTexts.swift
import Foundation

enum StaticTexts {
    static let lordsPrayer = """
하늘에 계신 우리 아버지여,
이름이 거룩히 여김을 받으시오며,
나라가 임하시오며,
뜻이 하늘에서 이루어진 것 같이 땅에서도 이루어지이다.
오늘 우리에게 일용할 양식을 주시옵고
우리가 우리에게 죄 지은 자를 사하여 준 것 같이 우리 죄를 사하여 주시옵고,
우리를 시험에 들게 하지 마시옵고, 다만 악에서 구하시옵소서.
나라와 권세와 영광이,
 아버지께 영원히 있사옵나이다.

아멘
"""
    
    static let apostlesCreed = """
전능하사 천지를 만드신 하나님
아버지를 내가 믿사오며,
그 외아들 우리 주 예수
그리스도를 믿사오니,
이는 성령으로 잉태하사
동정녀 마리아에게 나시고,
본디오 빌라도에게 고난을 받으사,
십자가에 못 박혀 죽으시고,
장사한지 사흘만에 죽은자 가운데서
다시 살아나시며,
하늘에 오르사 전능하신 하나님
우편에 앉아 계시다가,
저리로서 산 자와 죽은 자를
심판하러 오시리라.
성령을 믿사오며,거룩한 공회와
성도가 서로 교통하는 것과
죄를 사하여 주시는 것과
몸이 다시 사는 것과
영원히 사는 것을 믿사옵나이다.

아멘
"""
    
    static let tenCommandments = """
1.너는 나 외에는 다른 신들을 네게 두지 말라
2.너를 위하여 새긴 우상을 만들지 말고 또 위로 하늘에 있는 것이나 아래로 땅에 있는 것이나 땅 아래 물 속에 있는 것의 어떤 형상도 만들지 말며 그것들에게 절하지 말며 그것들을 섬기지 말라.
3.너는 네 하나님 여호와의 이름을 망령되게 부르지 말라.
4.안식일을 기억하여 거룩하게 지키라.
5..네 부모를 공경하라.
6.살인하지 말라.
7.간음하지 말라.
8.도둑질하지 말라.
9.네 이웃에 대하여 거짓 증거하지 말라.
10.네 이웃의 집을 탐내지 말라.
"""
}
